[
  {
    "slug": "basic-grid",
    "title": "Basic Grid",
    "description": "When starting a three.js project, all you'll see is a black screen. I created a grid to serve as a guide for new projects. This demo, in addition to future demos, uses Playground.js as the underlying Three.js core framework. You to move the camera with the mouse and pause the renderer with the space bar."
  },

  {
    "slug": "basic-geometry",
    "title": "Basic Geometry",
    "description": "One fundamental concept of Computer Graphics is that all 3D meshes, or rendered objects, are composed of 2D triangles. By using many triangles, a mesh will appear smoother and more realistic. For this demo, I created my own custom isosceles, equilateral, and scalene triangle geometries."
  },

  {
    "slug": "parthenon",
    "title": "Parthenon",
    "description": "My first independent Computer Graphics project. I learned about different lighting, meshes, and geometries. I also created a custom triangular prism geometry for the roof. When defining custom geometries, you'll definitely want to outline your work with paper and pencil first."
  },

  {
    "slug": "starfield-particles",
    "title": "Starfield Particles",
    "description": "Particles are rendered as a particle system where all the particles are treated as a single mesh rather than triangles. This makes particles extremely efficient even in large numbers--in the millions."
  },

  {
    "slug": "spotlight",
    "title": "Spotlight",
    "description": "This spotlight demo explores interactive lighting created by a spotlight using the dat.gui plugin. Many Three.js projects use the plugin to allow users to adjust variables in real-time. Play with it!"
  },

  {
    "slug": "chase-cam",
    "title": "Chase Cam",
    "description": "A chase cam is a concept that is very common in 3D video games. Basically the camera follows the user's character. You can move the cube with the WASD keys. This demo uses the Threex keyboard plugin for keyboard controls."
  },

  {
    "slug": "windmills",
    "title": "Windmills",
    "description": "For this project, I started exploring the simplest animation technique: rotation. I created a custom geometry for the windwill blades. The windmill itself is an Object3D, which is composed of several meshes. I also applied a Shader to create the dotted effect."
  },

  {
    "slug": "ocean",
    "title": "Ocean",
    "description": "This demo was recreated from the Three.js Ocean demo. I explored the mirror. brighness, and water shaders to achieve its realistic effect. Shaders maintain high performance by pipelining heavy computation into the GPU. I also explored normal maps for the ocean tide and used a skybox for the background."
  },

  {
    "slug": "dippy-bird",
    "title": "Dippy Bird",
    "description": "In this demo, I explored the animation technique called Tweening. Tweening generates key frames by interpolating the values in between two values. You can observe it in action as the dippy bird rocks back-and-forth in between sips of water."
  }

]
